{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Book-Input"}, "name": "Book-Input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "User-Input"}, "name": "User-Input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "Book-Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 10001, "output_dim": 5, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "Book-Embedding", "inbound_nodes": [[["Book-Input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "User-Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 53425, "output_dim": 5, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "User-Embedding", "inbound_nodes": [[["User-Input", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-Books", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-Books", "inbound_nodes": [[["Book-Embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-Users", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-Users", "inbound_nodes": [[["User-Embedding", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot-Product", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot-Product", "inbound_nodes": [[["Flatten-Books", 0, 0, {}], ["Flatten-Users", 0, 0, {}]]]}], "input_layers": [["User-Input", 0, 0], ["Book-Input", 0, 0]], "output_layers": [["Dot-Product", 0, 0]]}}, "training_config": {"loss": "mean_squared_error", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Book-Embedding/embeddings", "shape": [10001, 5], "dtype": "float32"}, {"name": "User-Embedding/embeddings", "shape": [53425, 5], "dtype": "float32"}]}]}